In [1]:
#imports
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
movies_connection = "mysql+pymysql://root:root@localhost/Movies"
from sqlalchemy.types import *

In [2]:
engine = create_engine(movies_connection)
engine

Engine(mysql+pymysql://root:***@localhost/Movies)

In [3]:
create_database(movies_connection)

In [4]:
database_exists(movies_connection)

True

In [5]:
df = pd.read_csv(r"Data/MovieProject/basics.csv.gz")
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

In [6]:
df = df.drop(columns=['originalTitle', 'isAdult', 'titleType'])
df.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama
3,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,Grizzly II: Revenge,2020,NaN,74,"Horror,Music,Thriller"

In [7]:
df['genres']

0           Comedy,Fantasy,Romance
1                            Drama
2                            Drama
3             Comedy,Horror,Sci-Fi
4            Horror,Music,Thriller
                   ...
79207                        Drama
79208         Comedy,Drama,Fantasy
79209                        Drama
79210    Action,Adventure,Thriller
79211                Drama,History
Name: genres, Length: 79212, dtype: object

In [8]:
df['genre_split'] = df['genres'].str.split(',')
df.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genre_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,Grizzly II: Revenge,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [9]:
genres_explode = df.explode('genre_split')
genres_explode[['tconst', 'primaryTitle', 'genre_split']]

,tconst,primaryTitle,genre_split
0,tt0035423,Kate & Leopold,Comedy
0,tt0035423,Kate & Leopold,Fantasy
0,tt0035423,Kate & Leopold,Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,Drama
2,tt0069049,The Other Side of the Wind,Drama
...,...,...,...
79210,tt9916190,Safeguard,Action
79210,tt9916190,Safeguard,Adventure
79210,tt9916190,Safeguard,Thriller
79211,tt9916362,Coven,Drama
79211,tt9916362,Coven,History

In [10]:
genres_uni = sorted(genres_explode['genre_split'].dropna().unique())
genres_uni

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [11]:
title_genres = genres_explode[['tconst', 'genre_split']]
title_genres

          tconst genre_split
0      tt0035423      Comedy
0      tt0035423     Fantasy
0      tt0035423     Romance
1      tt0062336       Drama
2      tt0069049       Drama
...          ...         ...
79210  tt9916190      Action
79210  tt9916190   Adventure
79210  tt9916190    Thriller
79211  tt9916362       Drama
79211  tt9916362     History

[148063 rows x 2 columns]

In [12]:
genre_id = range(len(genres_uni))
genre_dict = dict(zip(genres_uni, genre_id))
genre_dict

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [13]:
title_genres['genre_id'] = title_genres['genre_split'].map(genre_dict)
title_genres = title_genres.drop(columns='genre_split')
title_genres.head()

C:\Users\javaughn\Anaconda3\envs\dojo-env\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [14]:
genres = pd.DataFrame({'genre_id': genre_dict.values(), 'genre_name': genre_dict.keys()})
genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [15]:
df = df.drop(columns=['genres', 'genre_split'])
df.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0093119,Grizzly II: Revenge,2020,NaN,74

In [16]:
## get max string length
max_str_len = df['primaryTitle'].fillna('').map(len).max()

In [17]:
# Calculate max string lengths for object columns
key_len = df['tconst'].fillna('').map(len).max()
title_len = df['primaryTitle'].fillna('').map(len).max()
# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [18]:
# Save to sql with dtype and index=False
df.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

In [19]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [20]:
genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [21]:
genres_name_len = genres['genre_name'].fillna('').map(len).max()
genre_schema = {"genre_name": Text(genres_name_len+1),
               'genre_id': Integer()}

In [22]:
genres.to_sql('genres', engine, dtype = genre_schema, if_exists = 'replace', index = False)

In [23]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [24]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [25]:
title_genres_len = title_genres['tconst'].fillna('').map(len).max()
title_genres_schema = {"tconst": String(title_genres_len+1),
                      'genre_id': Integer()}

In [26]:
title_genres.to_sql('title_genres', engine, dtype = title_genres_schema, if_exists = 'replace', index = False)

In [27]:
ratings = pd.read_csv(r"Data/MovieProject/ratings.csv.gz")
ratings.head(3)

      tconst  averageRating  numVotes
0  tt0035423            6.4     83610
1  tt0062336            6.4       161
2  tt0069049            6.7      7198

In [28]:
ratings_len = ratings['tconst'].fillna('').map(len).max()
ratings_schema = {"tconst": String(ratings_len+1),
                 "averageRating": Float(),
                 'numVotes': Integer()}

In [29]:
ratings.to_sql('title_ratings', engine, dtype = ratings_schema, if_exists = 'replace', index = False)

In [30]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [31]:
tmdb = pd.read_csv(r"Data/MovieProject/tmdb_ALL_results_combined.csv.gz")
tmdb.head(3)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN

In [32]:
tmdb = tmdb[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb.head(3)

     imdb_id  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN
2  tt0113092      0.0         0.0           NaN

In [33]:
# Remove rows with missing information
tmdb = tmdb.loc[tmdb['imdb_id'] != '0']

In [34]:
tmdb.duplicated().sum()

0

In [35]:
tmdb = tmdb.reset_index(drop=True)

In [36]:
imdb_len = ratings['tconst'].fillna('').map(len).max()
cert_len = tmdb['certification'].fillna('').map(len).max()
tmdb_schema = {"imdb_id": String(imdb_len+1),
              "revenue": Float(),
              'budget': Float(),
              'certification': Text(cert_len+1)}

In [37]:
tmdb.to_sql('tmdb_data', engine, dtype = tmdb_schema, if_exists = 'replace', index = False)

In [39]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [41]:
genres = """SELECT *
FROM genres
LIMIT 5"""

pd.read_sql(genres, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [42]:
title_basics = """SELECT *
FROM title_basics
LIMIT 5"""

pd.read_sql(title_basics, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0093119,Grizzly II: Revenge,2020.0,None,74

In [43]:
title_genres = """SELECT *
FROM title_genres
LIMIT 5"""

pd.read_sql(title_genres, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [44]:
title_ratings = """SELECT *
FROM title_ratings
LIMIT 5"""

pd.read_sql(title_ratings, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     83610
1  tt0062336            6.4       161
2  tt0069049            6.7      7198
3  tt0088751            5.2       320
4  tt0093119            2.9      1140

In [45]:
tmdb_data = """SELECT *
FROM tmdb_data
LIMIT 5"""

pd.read_sql(tmdb_data, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0062336         0.0         0.0          None
2  tt0069049         0.0  12000000.0             R
3  tt0088751         0.0    350000.0          None
4  tt0093119         0.0   7500000.0          None

In [40]:
tables = """SHOW TABLES"""
pd.read_sql(tables, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data